In [10]:
import pandas as pd
import numpy as np

In [11]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='l'))
print(s1, s2, s3)

0     3
1     2
2     3
3     3
4     4
     ..
95    3
96    2
97    3
98    4
99    3
Length: 100, dtype: int32 0     2
1     3
2     3
3     2
4     3
     ..
95    1
96    3
97    3
98    2
99    3
Length: 100, dtype: int32 0     24257
1     21903
2     10903
3     11703
4     18954
      ...
95    27718
96    12635
97    26819
98    24768
99    19066
Length: 100, dtype: int32

In [12]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='l'))
print(s1, s2, s3)

0     1
1     2
2     2
3     2
4     1
     ..
95    3
96    1
97    3
98    2
99    4
Length: 100, dtype: int32 0     2
1     3
2     1
3     2
4     3
     ..
95    3
96    2
97    3
98    3
99    2
Length: 100, dtype: int32 0     17058
1     28928
2     24484
3     14049
4     22192
      ...
95    28732
96    24932
97    14046
98    26817
99    27953
Length: 100, dtype: int32

In [16]:
import pandas as pd

# Example DataFrame creation
housemkt = pd.DataFrame({
    0: [3, 2, 4],
    1: [2, 1, 3],
    2: [5000, 4000, 6000]
})

In [17]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2:
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       2             5000
1      2       1             4000
2      4       3             6000

In [18]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

In [19]:
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()

In [20]:
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [21]:
bigcolumn

        0
0       1
1       2
2       2
3       2
4       1
..    ...
95  28732
96  24932
97  14046
98  26817
99  27953

[300 rows x 1 columns]

In [22]:
len(bigcolumn)

300

In [23]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        2
2        2
3        2
4        1
..     ...
295  28732
296  24932
297  14046
298  26817
299  27953

[300 rows x 1 columns]